source/_static/diagrams/45-machine-in-config.d2
direction: right
n0: "portable class"
n1: "EESSI mixin"
n2: "site config"
n3: "any site"
n0 -> n1
n2 -> n3
